20210922010846-terraform.org
:PROPERTIES:
:ID:       9f6b36fd-a680-42db-a6f4-0ea21b355bc2
:mtime:    20241102180357
:ctime:    20210922010846
:END:
#+title: Terraform
* 概要
Terraformはインフラをコード管理できるツール。

- [[id:d17ea774-2739-44f3-89dc-97a86b2c7bf7][AWS]]でポチポチやらなくても、コードで環境を再現できる。
- [[id:90c6b715-9324-46ce-a354-63d09403b066][Git]]管理されている恩恵を受けられる
* Memo
** インストール
https://www.terraform.io/downloads
** ディレクトリ構成
共通リソースを作り、環境別に埋め込んで実行することで管理が楽になり、検証の正確度もあがる。[[https://dev.classmethod.jp/articles/directory-layout-bestpractice-in-terraform/][Terraformにおけるディレクトリ構造のベストプラクティス | DevelopersIO]]で紹介されている構成が管理しやすい。トップディレクトリに変数を埋め込んだ共通のリソースを配置する。下層の環境ディレクトリに環境ごとの可変の値を入れ、トップディレクトリをmodule指定することで挙動を変更する。
* Tasks
** 実践Terraform
:LOGBOOK:
CLOCK: [2022-04-10 Sun 15:06]--[2022-04-10 Sun 15:31] =>  0:25
CLOCK: [2022-04-10 Sun 14:41]--[2022-04-10 Sun 15:06] =>  0:25
:END:
* Reference
** [[https://dev.classmethod.jp/articles/aws-with-terraform/][既存のAWS環境を後からTerraformでコード化する | DevelopersIO]]
** [[https://beyondjapan.com/blog/2020/05/terraformer-import-existing-infrastructure/][Terraformerを使ってTerraformに既存インフラのリソースをインポートする | 株式会社ビヨンド]]
terraformer。
** [[https://www.lac.co.jp/lacwatch/service/20200903_002270.html][5分で分かるTerraform（Infrastructure as Code） | セキュリティ対策のラック]]
* Archives
