20210922010846-terraform.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-06 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Terraform</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">Terraform</h1>
<div id="outline-container-orgff78ee8" class="outline-2">
<h2 id="orgff78ee8"><a href="#orgff78ee8">概要</a></h2>
<div class="outline-text-2" id="text-orgff78ee8">
<p>
Terraformはインフラをコード管理できるツール。
</p>

<ul class="org-ul">
<li><a href="20211221000645-aws.html#ID-d17ea774-2739-44f3-89dc-97a86b2c7bf7">AWS</a>でポチポチやらなくても、コードで環境を再現できる。</li>
<li><a href="20210901104129-git.html#ID-90c6b715-9324-46ce-a354-63d09403b066">Git</a>管理されている恩恵を受けられる</li>
</ul>
</div>
</div>
<div id="outline-container-org11cfdc5" class="outline-2">
<h2 id="org11cfdc5"><a href="#org11cfdc5">Memo</a></h2>
<div class="outline-text-2" id="text-org11cfdc5">
</div>
<div id="outline-container-org73d00ea" class="outline-3">
<h3 id="org73d00ea"><a href="#org73d00ea">インストール</a></h3>
<div class="outline-text-3" id="text-org73d00ea">
<p>
<a href="https://www.terraform.io/downloads">https://www.terraform.io/downloads</a>
</p>
</div>
</div>
<div id="outline-container-org2fa8afc" class="outline-3">
<h3 id="org2fa8afc"><a href="#org2fa8afc">ディレクトリ構成</a></h3>
<div class="outline-text-3" id="text-org2fa8afc">
<p>
共通リソースを作り、環境別に埋め込んで実行することで管理が楽になり、検証の正確度もあがる。<a href="https://dev.classmethod.jp/articles/directory-layout-bestpractice-in-terraform/">Terraformにおけるディレクトリ構造のベストプラクティス | DevelopersIO</a>で紹介されている構成が管理しやすい。トップディレクトリに変数を埋め込んだ共通のリソースを配置する。下層の環境ディレクトリに環境ごとの可変の値を入れ、トップディレクトリをmodule指定することで挙動を変更する。
</p>
</div>
</div>
</div>
<div id="outline-container-org6f4d6f8" class="outline-2">
<h2 id="org6f4d6f8"><a href="#org6f4d6f8">Tasks</a></h2>
<div class="outline-text-2" id="text-org6f4d6f8">
</div>
<div id="outline-container-org786ce63" class="outline-3">
<h3 id="org786ce63"><a href="#org786ce63">実践Terraform</a></h3>
<div class="outline-text-3" id="text-org786ce63">
</div>
</div>
</div>
<div id="outline-container-org6fd9f8d" class="outline-2">
<h2 id="org6fd9f8d"><a href="#org6fd9f8d">Reference</a></h2>
<div class="outline-text-2" id="text-org6fd9f8d">
</div>
<div id="outline-container-org5632a87" class="outline-3">
<h3 id="org5632a87"><a href="#org5632a87"><a href="https://dev.classmethod.jp/articles/aws-with-terraform/">既存のAWS環境を後からTerraformでコード化する | DevelopersIO</a></a></h3>
</div>
<div id="outline-container-org9d2e53e" class="outline-3">
<h3 id="org9d2e53e"><a href="#org9d2e53e"><a href="https://beyondjapan.com/blog/2020/05/terraformer-import-existing-infrastructure/">Terraformerを使ってTerraformに既存インフラのリソースをインポートする | 株式会社ビヨンド</a></a></h3>
<div class="outline-text-3" id="text-org9d2e53e">
<p>
terraformer。
</p>
</div>
</div>
<div id="outline-container-org11c35a7" class="outline-3">
<h3 id="org11c35a7"><a href="#org11c35a7"><a href="https://www.lac.co.jp/lacwatch/service/20200903_002270.html">5分で分かるTerraform（Infrastructure as Code） | セキュリティ対策のラック</a></a></h3>
</div>
</div>
<div id="outline-container-org0295cd9" class="outline-2">
<h2 id="org0295cd9"><a href="#org0295cd9">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
